cswaroop-databases/postgres/xml/DFE/PI-EXP-1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:tns="http://www.fico.com">
	<soapenv:Header>
		<wsse:Security>Individual
			<wsse:UsernameToken>
				<wsse:Username>admin</wsse:Username>
				<wsse:Password>admin</wsse:Password>
			</wsse:UsernameToken>
		</wsse:Security>
	</soapenv:Header>
	<soapenv:Body>
		<tns:ProcessApplication>
			<tns:Input_ApplicationData>
				<tns:DealerReferenceNumber>CONEXP05</tns:DealerReferenceNumber>
				<tns:ApplicationType>Private Individual</tns:ApplicationType>
				<tns:VersionNumber>1</tns:VersionNumber>
				<tns:GIFSubmissionDate>2015-05-22</tns:GIFSubmissionDate>
				<tns:GIFSubmissionTime>14:20:00.0Z</tns:GIFSubmissionTime>
				<tns:InputSource>13</tns:InputSource>
				<tns:DFEStatus>New</tns:DFEStatus>
				<tns:DealerComments>This is new application</tns:DealerComments>
				<tns:RecordTransmissionType>AB</tns:RecordTransmissionType>
				<tns:DFESubmissionDateTime>2002-05-30T09:00:00</tns:DFESubmissionDateTime>
				<tns:CountryCode>IT</tns:CountryCode>
				<tns:DocumentLink1>Link1</tns:DocumentLink1>
				<tns:DocumentLink2>Link2</tns:DocumentLink2>
				<tns:DocumentLink3>Link3</tns:DocumentLink3>
				<tns:DocumentLink4>Link4</tns:DocumentLink4>
				<tns:DocumentLink5>Link5</tns:DocumentLink5>
				<tns:UpdateApplicationNumber>A123</tns:UpdateApplicationNumber>
				<tns:SalesPerson>Test</tns:SalesPerson>
				<tns:AssignedSalesPerson>Test</tns:AssignedSalesPerson>
				<tns:IsMissingDocsAttached>false</tns:IsMissingDocsAttached>
				<tns:IsWithdrawalRequest>false</tns:IsWithdrawalRequest>
				<tns:Dealer>
					<tns:DealerName>Italy Dealer1</tns:DealerName>
					<tns:DealerNumber>IT_D_1</tns:DealerNumber>
					<tns:DealerTelephoneNumber>1234567890</tns:DealerTelephoneNumber>
				</tns:Dealer>
				<tns:Applicants>
					<tns:WORCWS_GMFApplicant_DataRecord>
						<tns:Title>Mr</tns:Title>
						<tns:FirstName>ENRICO</tns:FirstName>
						<tns:Initial/>
						<tns:Surname>ABBA</tns:Surname>
						<tns:DOB>1946-02-18</tns:DOB>
						<tns:MaritalStatus>Single</tns:MaritalStatus>
						<tns:NoOfDependents>0</tns:NoOfDependents>
						<tns:PhoneDetails>
							<tns:WS_GMFPhone_Data>
								<tns:PhoneType>Home</tns:PhoneType>
								<tns:PhoneNumber>1234567890</tns:PhoneNumber>
							</tns:WS_GMFPhone_Data>
							<tns:WS_GMFPhone_Data>
								<tns:PhoneType>Work</tns:PhoneType>
								<tns:PhoneNumber>2345678901</tns:PhoneNumber>
							</tns:WS_GMFPhone_Data>
							<tns:WS_GMFPhone_Data>
								<tns:PhoneType>Mobile</tns:PhoneType>
								<tns:PhoneNumber>3456789012</tns:PhoneNumber>
							</tns:WS_GMFPhone_Data>
						</tns:PhoneDetails>
						<tns:EmailAddress>richard_stanley@gmail.com</tns:EmailAddress>
						<tns:PrimaryContact>yes</tns:PrimaryContact>
						<tns:Gender>Male</tns:Gender>
						<tns:ResidentialStatus>Rents</tns:ResidentialStatus>
						<tns:FutureObligations>yes</tns:FutureObligations>
						<tns:UseOfCreditInfo>no</tns:UseOfCreditInfo>
						<tns:PartyType>Main Applicant</tns:PartyType>
						<tns:ExistingCustomer>N</tns:ExistingCustomer>
						<tns:GuaranteeAvailable>no</tns:GuaranteeAvailable>
						<tns:BirthCity>MELEGNANO</tns:BirthCity>
						<tns:BirthProvince>MI</tns:BirthProvince>
						<tns:PIN>BBANRC46B18F100O</tns:PIN>
						<tns:Nationality>Italy</tns:Nationality>
						<tns:DocumentCode>Passaporto</tns:DocumentCode>
						<tns:DocumentID>test</tns:DocumentID>
						<tns:DocumentIssueDate>2015-05-22</tns:DocumentIssueDate>
						<tns:DocumentExpiryDate>2018-05-22</tns:DocumentExpiryDate>
						<tns:DocumentReleaseAuthority>MTC</tns:DocumentReleaseAuthority>
						<tns:PoliticallyExposed>false</tns:PoliticallyExposed>
						<tns:ResidentialStatusManual>Rents</tns:ResidentialStatusManual>
						<tns:Relationship>Brother</tns:Relationship>
						<tns:IsSelfEmployed>false</tns:IsSelfEmployed>
						<tns:IsSoleTrader>false</tns:IsSoleTrader>
						<tns:ApplicantPositionInApp>1</tns:ApplicantPositionInApp>
						<tns:Role>Main Applicant</tns:Role>
						<tns:Address>
							<tns:WS_GMFApplicantAddress_Data>
								<tns:AddressType>Current</tns:AddressType>
								<tns:YearsAtAddress>10</tns:YearsAtAddress>
								<tns:MonthsAtAddress>10</tns:MonthsAtAddress>
								<tns:YearsAtAddressManual>10</tns:YearsAtAddressManual>
								<tns:MonthsAtAddressManual>10</tns:MonthsAtAddressManual>
								<tns:MonthlyRent>2000</tns:MonthlyRent>
								<tns:AddressLocation>
									<tns:HouseNumber>6</tns:HouseNumber>
									<tns:HouseName/>
									<tns:FlatNumber/>
									<tns:StreetAddress>VIA TINTORETTO</tns:StreetAddress>
									<tns:PostCode>10020</tns:PostCode>
									<tns:Locality/>
									<tns:Town>ARCORE</tns:Town>
									<tns:StreetType>L GO BACHELET</tns:StreetType>
									<tns:Province>RA</tns:Province>
								</tns:AddressLocation>
							</tns:WS_GMFApplicantAddress_Data>
						</tns:Address>
						<tns:BankDetail>
							<tns:AccountHolder>ALBERTO GALLI</tns:AccountHolder>
							<tns:BankTimeYears>10</tns:BankTimeYears>
							<tns:BankTimeMonths>10</tns:BankTimeMonths>
							<tns:PaymentMethod>direct debit</tns:PaymentMethod>
							<tns:AccountNumber>12345678</tns:AccountNumber>
							<tns:SortCode>SC</tns:SortCode>
							<tns:BankName>Barclays</tns:BankName>
							<tns:AddressLocationRecord>
								<tns:HouseNumber>25</tns:HouseNumber>
								<tns:HouseName>Barclay Tower</tns:HouseName>
								<tns:FlatNumber/>
								<tns:StreetAddress>High Street</tns:StreetAddress>
								<tns:PostCode>BA13 3BN</tns:PostCode>
								<tns:Locality>Wilshire</tns:Locality>
								<tns:Town>Westbury</tns:Town>
							</tns:AddressLocationRecord>
						</tns:BankDetail>
						<tns:EmploymentDetail>
							<tns:WS_GMFApplicantEmployment_Data>
								<tns:EmploymentTypeCd>Current</tns:EmploymentTypeCd>
								<tns:EmploymentType>Employed</tns:EmploymentType>
								<tns:Profession>Pensionato</tns:Profession>
								<tns:Occupation>Accountant</tns:Occupation>
								<tns:EmployerName>FICO</tns:EmployerName>
								<tns:PhoneNumber>5557779809</tns:PhoneNumber>
								<tns:EmploymentYears>10</tns:EmploymentYears>
								<tns:EmploymentMonths>10</tns:EmploymentMonths>
								<tns:AnnualIncome>100000.23</tns:AnnualIncome>
								<tns:EmploymentYearsManual>10</tns:EmploymentYearsManual>
								<tns:EmploymentMonthsManual>10</tns:EmploymentMonthsManual>
								<tns:NetMonthlySalary>5000</tns:NetMonthlySalary>
								<tns:NetMonthlySalaryManual>5000</tns:NetMonthlySalaryManual>
								<tns:NoOfSalaryPayments>3</tns:NoOfSalaryPayments>
								<tns:EmploymentType>Permanent</tns:EmploymentType>
								<tns:AddressLocation>
									<tns:HouseNumber>123</tns:HouseNumber>
									<tns:HouseName>FICO Tower</tns:HouseName>
									<tns:FlatNumber/>
									<tns:StreetAddress>High Street</tns:StreetAddress>
									<tns:PostCode>BA13 3BN</tns:PostCode>
									<tns:Locality>Wilshire</tns:Locality>
									<tns:Town>Westbury</tns:Town>
									<tns:StreetType>Via</tns:StreetType>
									<tns:Province>SS</tns:Province>
								</tns:AddressLocation>
								<tns:EmploymentTypeCd>Pensionato</tns:EmploymentTypeCd>
							</tns:WS_GMFApplicantEmployment_Data>
							<tns:WS_GMFApplicantEmployment_Data>
								<tns:EmploymentTypeCd>Previous</tns:EmploymentTypeCd>
								<tns:EmploymentType>Employed</tns:EmploymentType>
								<tns:Occupation>Accountant</tns:Occupation>
								<tns:EmployerName>GMF UK PLC</tns:EmployerName>
								<tns:PhoneNumber>String</tns:PhoneNumber>
								<tns:EmploymentYears>5</tns:EmploymentYears>
								<tns:EmploymentMonths>4</tns:EmploymentMonths>
								<tns:AnnualIncome>90000</tns:AnnualIncome>
								<tns:EmploymentType>Permanent</tns:EmploymentType>
								<tns:EmploymentTypeCd>Pensionato</tns:EmploymentTypeCd>
								<tns:AddressLocation>
									<tns:HouseNumber>123</tns:HouseNumber>
									<tns:HouseName>String</tns:HouseName>
									<tns:FlatNumber>3456</tns:FlatNumber>
									<tns:StreetAddress>String</tns:StreetAddress>
									<tns:PostCode>BA13 3BN</tns:PostCode>
									<tns:Locality>String</tns:Locality>
									<tns:Town>Westbury</tns:Town>
									<tns:StreetType>Via</tns:StreetType>
									<tns:Province>SS</tns:Province>
								</tns:AddressLocation>
							</tns:WS_GMFApplicantEmployment_Data>
						</tns:EmploymentDetail>
					</tns:WORCWS_GMFApplicant_DataRecord>
				</tns:Applicants>
				<tns:Vehicle>
					<tns:Type>New</tns:Type>
					<tns:Category>LCV</tns:Category>
					<tns:Make>CHEVROLET</tns:Make>
					<tns:Model>IMPALA</tns:Model>
					<tns:Variant>2015</tns:Variant>
					<tns:VehicleId>007</tns:VehicleId>
					<tns:RegistrationNumber>AGN 007</tns:RegistrationNumber>
					<tns:VIN>V123456</tns:VIN>
					<tns:FirstRegistrationDate>2015-04-25</tns:FirstRegistrationDate>
					<tns:VATQualifying>No</tns:VATQualifying>
					<tns:Mileage>1</tns:Mileage>
					<tns:RegistrationPlate>0</tns:RegistrationPlate>
					<tns:VehicleValuationSystem>25000</tns:VehicleValuationSystem>
					<tns:VehicleUsage>Both</tns:VehicleUsage>
					<tns:FFO>0</tns:FFO>
					<tns:FreeFormatEntry>1</tns:FreeFormatEntry>
				</tns:Vehicle>
				<tns:VehicleFinance>
					<tns:VehicleCashSellingPrice>2000</tns:VehicleCashSellingPrice>
					<tns:VAPS>5000</tns:VAPS>
					<tns:CashDeposit>11000</tns:CashDeposit>
					<tns:FDA>1</tns:FDA>
					<tns:TradeInEquity>5000</tns:TradeInEquity>
					<tns:TotalAmountFinanced>15000</tns:TotalAmountFinanced>
					<tns:Term>30</tns:Term>
					<tns:LoanType>P</tns:LoanType>
					<tns:FlatRate>1</tns:FlatRate>
					<tns:APR>0</tns:APR>
					<tns:Frequency>Monthly</tns:Frequency>
					<tns:AnnualMileage>10000</tns:AnnualMileage>
					<tns:TotalDeposit>10000</tns:TotalDeposit>
					<tns:SettlementAmount>10000</tns:SettlementAmount>
					<tns:Balloon_GFV>0</tns:Balloon_GFV>
					<tns:Plan>L</tns:Plan>
					<tns:TotalAmountPayable>45000</tns:TotalAmountPayable>
					<tns:InitialPayment>1000</tns:InitialPayment>
					<tns:SecurityDeposit>1</tns:SecurityDeposit>
					<tns:PartExchange>1</tns:PartExchange>
					<tns:AdvancePayment>1</tns:AdvancePayment>
					<tns:Interest>0</tns:Interest>
					<tns:Rental>0</tns:Rental>
					<tns:Payment>900</tns:Payment>
					<tns:CostIncVAT>100000</tns:CostIncVAT>
					<tns:ProductCode/>
					<tns:FinanceType>SMARTBUY</tns:FinanceType>
					<tns:SettlementFlag>1</tns:SettlementFlag>
					<tns:DealersExtras>3000</tns:DealersExtras>
					<tns:Discount>234</tns:Discount>
					<tns:TEG>245</tns:TEG>
					<tns:FinanceFees>100</tns:FinanceFees>
					<tns:NominalRate>50</tns:NominalRate>
				</tns:VehicleFinance>
			</tns:Input_ApplicationData>
		</tns:ProcessApplication>
	</soapenv:Body>
</soapenv:Envelope>
